/* eslint-disable react/no-unescaped-entities */
import React from "react";
import style from "./PrivacyPolicy.module.scss";

export const PrivacyPolicy: React.FC = () => {
  return (
    <div className={style.container}>
      <div className={style.content}>
        <h1 className={style.h1}>
          Согласие на&nbsp;сбор и&nbsp;обработку персональных данных
          клиентов&nbsp;&mdash; физических лиц
        </h1>
        <p>
          Принимая условия настоящего Согласия на&nbsp;сбор и&nbsp;обработку
          персональных данных (далее&nbsp;&mdash; Согласие), Пользователь или
          его законный представитель даёт своё согласие автономной организации
          образования &laquo;Назарбаев Интеллектуальные школы&raquo;
          (далее&nbsp;&mdash; Организатор) на&nbsp;сбор, обработку,
          использование и&nbsp;хранение своих персональных данных, а&nbsp;именно
          совершение действий, предусмотренных статьей 8&nbsp;главы
          2&nbsp;Законом Республики Казахстан от&nbsp;21&nbsp;мая 2013 года
          &#8470;&nbsp;94-V &laquo;О&nbsp;персональных данных
          и&nbsp;их&nbsp;защите&raquo;, и&nbsp;подтверждает, что, давая такое
          согласие, он&nbsp;действует свободно, своей волей и&nbsp;в&nbsp;своих
          интересах, путем заполнения веб-форм персональными данными
          на&nbsp;сайте https://synaq.beyim.ai/ (далее&nbsp;&mdash; Сайт) или
          мобильном приложении &laquo;Beyim Synaq&raquo; (далее&nbsp;&mdash;
          мобильное приложение).
        </p>
        <p>
          Интеллектуальная собственность на&nbsp;Сайт/мобильное приложение
          принадлежит Автономной организации образования &laquo;Назарбаев
          интеллектуальные школы&raquo;. Организатор использует Сайт/мобильное
          приложение на&nbsp;правах лицензионного договора. Интеллектуальная
          собственность на&nbsp;контент на&nbsp;Сайте/мобильном приложении
          принадлежит Организатору. Ответственность за&nbsp;содержание контента
          возлагается на Организатора. Организатор не&nbsp;проверяет
          достоверность персональных данных, предоставляемых Пользователем,
          и&nbsp;не&nbsp;имеет возможности оценивать его дееспособность. Однако
          Организатор исходит из&nbsp;того, что Пользователь предоставляет
          достоверную и&nbsp;достаточную персональную информацию
          и&nbsp;поддерживает эту информацию в&nbsp;актуальном состоянии.
        </p>
        <p>
          Пользователь или его законный представитель выражают согласие
          Организатору обрабатывать свои персональные данные для обеспечения
          работоспособности Сайта и&nbsp;мобильного приложения &laquo;Beyim
          Synaq&raquo;, установленного через магазин приложений (Google Play/App
          Store), и иных целей, предусмотренных настоящим согласием.
        </p>
        <p>
          Обработка персональных данных может производиться как без
          использования средств автоматизации, так
          и&nbsp;с&nbsp;их&nbsp;использованием. Данное Согласие дается
          на&nbsp;сбор и&nbsp;обработку следующих персональных данных, не
          являющихся специальными или биометрическими:
        </p>
        <ul>
          <li>фамилия, имя;</li>
          <li>адрес электронной почты;</li>
          <li>номер мобильного телефона;</li>
          <li>страна проживания;</li>
          <li>город проживания;</li>
          <li>место работы, должность.</li>
        </ul>
        <p>
          Пользователь или его законный представитель принимает политику
          использования файлов cookies, содержащуюся на&nbsp;Сайте/мобильном
          приложении, и&nbsp;даёт согласие на&nbsp;получение информации
          об&nbsp;IP-адресе и иных сведений о&nbsp;его активности
          на&nbsp;Сайте/мобильном приложении, в&nbsp;том числе: данные
          геолокации, тип и&nbsp;операционная система устройства, с помощью
          которого Пользователь или его законный представитель осуществляет
          работу с&nbsp;Сайтом/мобильным приложением, разрешение экрана, версия
          браузера, язык операционной системы, источник и&nbsp;канал трафика.
          Данная информация не&nbsp;используется для установления личности
          Пользователя.
        </p>
        <p>Персональные данные Пользователя не&nbsp;являются общедоступными.</p>
        <p>Цели сбора и&nbsp;обработки персональных данных:</p>
        <ul>
          <li>
            идентификация стороны в&nbsp;рамках предоставления сервисов
            и&nbsp;услуг Организатором;
          </li>
          <li>
            связь с&nbsp;Пользователем, в&nbsp;том числе направление
            уведомлений, запросов и&nbsp;информации, касающихся предоставления
            сервисов и&nbsp;услуг, а&nbsp;также обработка запросов и&nbsp;заявок
            от&nbsp;Пользователя;
          </li>
          <li>рассылка информационных материалов;</li>
          <li>
            проведение статистических и&nbsp;иных исследований на&nbsp;основе
            обезличенных данных.
          </li>
        </ul>
        <p>
          В&nbsp;соответствии со&nbsp;статьей 9&nbsp;Закона Республики Казахстан
          от&nbsp;21&nbsp;мая 2013 года &#8470;&nbsp;94-V
          &laquo;О&nbsp;персональных данных и&nbsp;их&nbsp;защите&raquo;, сбор,
          обработка персональных данных может производиться без согласия
          Пользователя или его законного представителя в&nbsp;случаях:
        </p>
        <ul>
          <li>
            осуществления деятельности правоохранительных органов и&nbsp;судов,
            исполнительного производства;
          </li>
          <li>осуществления государственной статистической деятельности;</li>
          <li>
            использования государственными органами персональных данных для
            статистических целей с&nbsp;обязательным условием
            их&nbsp;обезличивания;
          </li>
          <li>
            реализации международных договоров, ратифицированных Республикой
            Казахстан;
          </li>
          <li>
            защиты конституционных прав и&nbsp;свобод человека
            и&nbsp;гражданина, если получение согласия субъекта или его
            законного представителя невозможно;
          </li>
          <li>
            осуществления законной профессиональной деятельности
            журналиста&nbsp;и (или) деятельности средства массовой информации
            либо научной, литературной или иной творческой деятельности при
            условии соблюдения требований законодательства Республики Казахстан
            по&nbsp;обеспечению прав и&nbsp;свобод человека и&nbsp;гражданина;
          </li>
          <li>
            опубликования персональных данных в&nbsp;соответствии
            с&nbsp;законами Республики Казахстан, в&nbsp;том числе персональных
            данных кандидатов на выборные государственные должности;
          </li>
          <li>
            неисполнения субъектом своих обязанностей по&nbsp;представлению
            персональных данных в&nbsp;соответствии с&nbsp;законами Республики
            Казахстан;
          </li>
          <li>
            получения государственным органом, осуществляющим регулирование,
            контроль и&nbsp;надзор финансового рынка и&nbsp;финансовых
            организаций, информации от&nbsp;физических и&nbsp;юридических лиц
            в&nbsp;соответствии с законодательством Республики Казахстан;
          </li>
          <li>
            получения органами государственных доходов для осуществления
            налогового администрирования&nbsp;и (или) контроля информации от
            физических и&nbsp;юридических лиц в&nbsp;соответствии
            с&nbsp;законами Республики Казахстан;
          </li>
          <li>
            передачи на&nbsp;хранение резервной копии электронных информационных
            ресурсов, содержащих персональные данные ограниченного доступа, на
            единую национальную резервную платформу хранения электронных
            информационных ресурсов в&nbsp;случаях, предусмотренных законами
            Республики Казахстан;
          </li>
          <li>
            использования персональных данных субъектов предпринимательства,
            относящихся непосредственно к&nbsp;их&nbsp;предпринимательской
            деятельности, для формирования реестра бизнес-партнеров при условии
            соблюдения требований законодательства Республики Казахстан;
          </li>
          <li>
            в&nbsp;иных случаях, установленных законами Республики Казахстан.
          </li>
        </ul>
        <p>
          Пользователь подтверждает, что в&nbsp;случае необходимости
          предоставления персональных данных для достижения указанных выше целей
          (на&nbsp;условиях соблюдения конфиденциальности и&nbsp;обеспечения
          безопасности персональных данных при их&nbsp;обработке) третьему лицу,
          равно как привлечения третьих лиц к&nbsp;оказанию услуг
          в&nbsp;указанных целях и&nbsp;передачи Организатором принадлежащих ему
          функций иному лицу, Организатор вправе в&nbsp;необходимом объеме
          раскрывать для совершения вышеуказанных действий информацию о
          Пользователе, включая его персональные данные, таким третьим лицам,
          иным уполномоченным ими лицам, а&nbsp;также предоставлять таким лицам
          соответствующие документы, содержащие такую информацию. Также
          Пользователь подтверждает, что Согласие считается Пользователем
          выданным третьим лицам, указанным выше, с&nbsp;учетом соответствующих
          изменений, и&nbsp;такие третьи лица имеют право на&nbsp;обработку
          персональных данных Пользователя на&nbsp;основании настоящего Согласия
          в&nbsp;рамках Закона Республики Казахстан от&nbsp;21&nbsp;мая 2013
          года &#8470;&nbsp;94-V &laquo;О&nbsp;персональных данных
          и&nbsp;их&nbsp;защите&raquo;.
        </p>
        <p>
          В&nbsp;ходе обработки с&nbsp;персональными данными будут совершены
          следующие действия: сбор; обработка; запись; систематизация;
          накопление; хранение; уточнение (обновление, изменение); извлечение;
          использование; передача (распространение, предоставление, доступ);
          блокирование; удаление; уничтожение. Также может осуществляться
          Трансграничная передача&nbsp;&mdash; передача персональных данных
          на&nbsp;территорию иностранного государства, органу власти
          иностранного государства, иностранному физическому лицу или
          иностранному юридическому лицу.
        </p>
        <p>
          Трансграничная передача персональных данных может осуществляться в
          соответствии с&nbsp;законодательством Республики Казахстан.
        </p>
        <p>
          Трансграничная передача персональных данных на&nbsp;территорию
          иностранных государств осуществляется только в&nbsp;случае обеспечения
          этими государствами защиты персональных данных.
        </p>
        <p>
          Трансграничная передача персональных данных может осуществляться в
          центры обработки данных Правообладателя. Передача персональных данных
          третьим лицам может осуществляться в&nbsp;соответствии
          с&nbsp;действующим законодательством Республики Казахстан,
          с&nbsp;согласия Пользователя и&nbsp;в установленных законодательством
          Республики Казахстан случаях, когда передача персональных данных может
          осуществляться без согласия Пользователя.
        </p>
        <p>
          Обрабатываемые персональные данные уничтожаются по&nbsp;достижении
          целей обработки или в&nbsp;случае утраты необходимости
          в&nbsp;достижении этих целей, если иное не&nbsp;предусмотрено
          законодательством Республика Казахстан. Также обработка персональных
          данных может быть прекращена по&nbsp;запросу Пользователя или его
          законного представителя.
        </p>
        <p>
          Данное Согласие может быть отозвано Пользователем персональных данных
          или его законным представителем путем направления письменного
          заявления на&nbsp;адрес Организатора. Отзыв Согласия не&nbsp;влияет на
          законность обработки персональных данных Пользователя Организатором,
          которая была основана на&nbsp;Согласии до&nbsp;его отзыва.
        </p>
        <p>Меры по&nbsp;защите персональных данных Пользователя.</p>
        <p>
          Организатор и&nbsp;Правообладатель в&nbsp;рамках лицензионного
          договора принимают технические и&nbsp;организационно-правовые меры
          в&nbsp;целях обеспечения защиты персональных данных Пользователя
          от&nbsp;неправомерного или случайного доступа к&nbsp;ним, уничтожения,
          изменения, блокирования, копирования, распространения, а&nbsp;также
          от&nbsp;иных неправомерных действий.
        </p>
        <p>
          При утрате или разглашении персональных данных Организатор информирует
          Пользователя или его законного представителя об&nbsp;утрате или
          разглашении персональных данных. Организатор совместно
          с&nbsp;Пользователем или его законным представителем принимают все
          необходимые меры по предотвращению убытков или иных отрицательных
          последствий, вызванных утратой или разглашением персональных данных
          Пользователя. В&nbsp;случае утраты или разглашения персональных данных
          Организатор не&nbsp;несет ответственность, если данная информация
          стала публичным достоянием до её&nbsp;утраты или разглашения, или была
          получена третьей стороной до момента её&nbsp;получения Организатором,
          или была разглашена с&nbsp;Согласия Пользователя.
        </p>
        <p>
          Настоящее Согласие действует всё время до&nbsp;момента прекращения
          обработки персональных данных, указанных в&nbsp;п.11 и&nbsp;п.12
          данного Согласия.
        </p>
      </div>
    </div>
  );
};
